cell_size = 20
grid_size = 30
width     = cell_size * grid_size
hight     = cell_size * grid_size
fps       = 10

Colors = {
    "background": (225, 210, 180),  # کرم خاکی روشن
    "grid": (210, 195, 165),        # رنگ خطوط گرید (کمی تیره‌تر از پس‌زمینه)
    "border": (80, 50, 30),         # رنگ قهوه‌ای تیره برای قاب/دیوار
    "snake": (34, 139, 34),         # سبز جنگلی
    "snake_head": (0, 100, 0),      # سبز تیره برای سر
    "food": (200, 0, 0),            # قرمز میوه‌ای
    "obstacle": (60, 60, 60),       # خاکستری سنگی
    "power": (255, 215, 0),         # طلایی برای جعبه شانس
    "text": (50, 30, 20),           # قهوه‌ای سوخته برای متون
    "speed": (255, 194, 194),          # نارنجی قرمز برای حالت سرعت
    "invincible": (255, 255, 255)   # سفید/درخشان برای شکست‌ناپذیری
}

